# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Playing with data frame
# df=(data,index(Rows),columns)

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [3]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
df.to_csv('Test1.csv')

In [5]:
# Access the Elements
# 1. loc      2.iloc(index location)

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [6]:
type(df.loc['Row1'])

pandas.core.series.Series

In [7]:
# Series can be either one row or one column

df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [8]:
type(df.iloc[:,1:])

pandas.core.frame.DataFrame

In [9]:
# if more than one column then the type is data frame
# if one column then the type is series

In [10]:
#convert Dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [11]:
df.iloc[:,1:].values.shape

(5, 3)

In [12]:
df.isnull().sum()
# Checking if the data set has null values

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [13]:
df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [14]:
df=pd.read_csv('mercedesbenz.csv')

In [15]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,6,88.53,k,t,av,e,d,y,l,o,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,7,76.26,az,w,n,c,d,x,j,x,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,9,80.62,az,t,n,f,d,x,l,e,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,13,78.02,az,v,n,f,d,h,d,n,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3254 entries, 0 to 3253
Columns: 378 entries, ID to X385
dtypes: float64(135), int64(235), object(8)
memory usage: 9.4+ MB

In [17]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,3254.000000,3254.000000,3254.000000,3254.0,3254.000000,3254.000000,3254.000000,3254.000000,3254.000000,3254.000000,...,3253.000000,3253.000000,3253.000000,3253.000000,3253.000000,3253.00000,3253.000000,3253.000000,3253.000000,3253.000000
mean,3249.091272,101.136543,0.013522,0.0,0.068224,0.060234,0.431776,0.000615,0.003073,0.008912,...,0.308331,0.062097,0.325546,0.018137,0.007993,0.00830,0.008915,0.001844,0.000615,0.000922
std,1886.045218,12.983149,0.115512,0.0,0.252168,0.237956,0.495400,0.024788,0.055359,0.093997,...,0.461875,0.241368,0.468650,0.133468,0.089057,0.09074,0.094011,0.042914,0.024792,0.030359
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,0.000000,0.000000
25%,1595.500000,91.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,0.000000,0.000000
50%,3263.000000,99.475000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000,0.000000,0.000000
75%,4896.250000,109.400000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.00000,0.000000,0.000000,0.000000,0.000000
max,6491.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.00000,1.000000,1.000000,1.000000,1.000000

In [19]:
# Get the unique category counts
df["X0"].value_counts()

ak    277
z     274
y     264
t     246
ay    236
x     231
o     222
f     156
n     152
az    137
w     132
j     130
aj    127
s      88
ap     80
h      52
d      52
al     48
v      32
af     31
ai     28
m      23
at     22
ba     20
e      19
ax     15
a      15
i      13
aq     13
am     12
ad     12
l      12
aw     11
u      11
k      11
b       9
r       9
au      8
as      7
bc      4
ao      3
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [20]:
df[df['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,24,128.76,al,r,e,f,d,f,h,s,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,27,108.67,w,s,as,e,d,f,i,h,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
10,31,102.09,h,r,r,f,d,f,h,p,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3244,6480,114.33,ak,w,ak,c,d,s,g,b,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3245,6482,112.08,as,v,as,a,d,s,i,f,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3248,6486,111.24,x,r,as,f,d,s,d,r,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3250,6488,114.92,j,b,aq,a,d,s,g,e,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3252,6490,108.12,ak,v,r,a,d,s,i,i,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

# CSV

In [21]:
from io import StringIO, BytesIO

In [22]:

data = ('col1,col2,col3\n'
            'x,y,1\n'
            'a,b,2\n'
            'c,d,3')

In [23]:
type(data)

str

In [24]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [26]:
# Read from specific Columns
df=pd.read_csv(StringIO(data), usecols=['col1', 'col3'])

In [27]:
df.head()

  col1  col3
0    x     1
1    a     2
2    c     3

In [28]:
df.to_csv('Test.csv')

In [36]:
## Specifying columns data types

data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11,12')

In [37]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [38]:
df=pd.read_csv(StringIO(data),dtype=object)

In [39]:
df.head()

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [40]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [41]:
df['a'][1]

'5'

In [42]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [45]:
# Seperate data types for each column
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'Int64'})

In [46]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [49]:
df['c'][1]

7.0

In [50]:
## Index columns and training delimiters

In [51]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')

In [52]:
pd.read_csv(StringIO(data))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [53]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [54]:
pd.read_csv(StringIO(data),index_col=3)

      index       a    b
c
5.7       4   apple  bat
10.0      8  orange  cow

In [55]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [56]:
data = ('a,b,c\n'
           '4,apple,bat,\n'
            '8,orange,cow,')

In [57]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [58]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [60]:
## Combining usecols and index_col
data = ('a,b,c\n'
           '4,apple,bat,\n'
            '8,orange,cow,')

In [61]:
pd.read_csv(StringIO(data), usecols=['b', 'c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [64]:
# Quoting and Escape Characters¶. Very useful in NLP

data = 'a,b\n"hello, \\"Bob\\", nice to see you",5iu'

In [65]:
pd.read_csv(StringIO(data),escapechar='\\')

                               a    b
0  hello, "Bob", nice to see you  5iu